# SQL : Structured Query Language

We will follow a series of exercises to get familiar with SQL and ORM.

ORM can be an abstract concept, to help you compare, the exercises will be a combination of traditional queries and sql alchemy.

## Setting up your notebook

- To facilitate developing, you can run this notebook on a [Google Collab](https://colab.research.google.com/)

In [1]:
# Load the SQL magic extension
# https://github.com/catherinedevlin/ipython-sql
# this extension allows us to connect to DBs and issue SQL command
%load_ext sql

In [2]:
# To run SQL code on a Jupyter notebook cell, you can use the magig command %%sql

In [3]:
%%sql
SELECT sqlite_version();

Environment variable $DATABASE_URL not set, and no connect string given.
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

After running the previous cell, we encounter the error `$DATABASE_URL not set, and no connect string given.`. This is due, until know a connection with a database have not being established.

## Create a database with SQL Alchemy

The ***Declarative Mapping*** is the typical way that mappings are constructed in modern SQLAlchemy.

[Declarative mapping and alternatives](https://docs.sqlalchemy.org/en/14/orm/mapping_styles.html#orm-declarative-mapping)

In [4]:
from sqlalchemy import Column, Integer, String, ForeignKey
from sqlalchemy.orm import declarative_base
from sqlalchemy import create_engine
from sqlalchemy.orm import sessionmaker

# declarative base class
Base = declarative_base()

# an example mapping using the base
class User(Base):
    __tablename__ = 'user'

    id = Column(Integer, primary_key=True)
    name = Column(String)
    fullname = Column(String)
    nickname = Column(String)

The `Engine` is the starting point for any SQLAlchemy application, it represents a Python object that can be used for:

- interact directly with the database,
- can be passed to a Session object to work with the ORM,


`create_engine()`  function produces an `Engine` object based on a URL

In [5]:
engine = create_engine('sqlite:///MyDataBase.db')

*Note the use of `///` to indicate a relative file path.*

In [6]:
print(type(engine))

<class 'sqlalchemy.engine.base.Engine'>

The typical form of a database URL is:
`dialect+driver://username:password@host:port/database`

In this case we are using [SQLite](https://www.sqlite.org/index.html) a database engine broadly used worldwide for desktop and mobile aplications and provides the advantage of containing the database into one file `DB.db`.

Among the supported databases on sql alchemy we can list:

- SQLite
- PosgreSQL
- MySQL
- Oracle
- Microsoft SQL Server

In [7]:
# Create database following parameters defined on `Base`:
Base.metadata.create_all(engine)

***Refresh local files of your working directory, now you should be able to see the file `MyDataBase.db`***

In [8]:
# Connecting to database:

%sql sqlite:///MyDataBase.db

'Connected: @MyDataBase.db'

In [9]:
%%sql

-- # In SQL the comments are declared with --
-- # Query to select values on table "user" from MyDataBase.db


SELECT * FROM user;

 * sqlite:///MyDataBase.db
Done.

[]

The table `user` declared previously on `class User(Base)` exist on the database but no data has been stored yet.

# Database sessions

A `DBSession()` instance establishes all conversations with the database during your session. 
- Any change made against the objects in the
session won't be persisted into the database until you call:
- `session.commit()`. *(Just like using git)*

If you're not happy about the changes, you can
revert all of them back to the last commit by calling

- `session.rollback()`

In [10]:
# Bind the engine to the metadata of the Base class so that the
# declaratives can be accessed through a DBSession instance
Base.metadata.bind = engine
DBSession = sessionmaker(bind=engine)
session = DBSession()

## Insert information into table *ORM approach*

In [11]:
# Using `class User(Base)` to input new parameters into the table `user`
my_first_table = User(name="Arnold", fullname="Arnold Schwarzenegger", nickname="Terminator")

In [12]:
# Add and commit changes to table `user`
session.add(my_first_table)
session.commit()
print(my_first_table)

<__main__.User object at 0x7f876f0f75d0>

`my_first_table` is a Python object, what means we can interact with the table in the same way done with other functions:

In [13]:
print(my_first_table.id)
print(my_first_table.name)
print(my_first_table.fullname)
print(my_first_table.nickname)

1
Arnold
Arnold Schwarzenegger
Terminator

## Insert information to table *using Queries*

Instead of using `class User(Base)`, we will add the values to the table using directly SQL queries. This, with the purpose of ilustrate with a pragmatical example the working methods using ORM vs SQL queries.

In [14]:
%%sql

--# Insert values into the table `user`

INSERT INTO user(id, name, fullname, nickname)
    VALUES (2,'Jennifer','Jennifer Aniston','Rachel'), 
    (3,'Tyrannosaurus','Tyrannosaurus Rex', 'T-Rex'), 
    (4,'Neil','Neil Patrick Harris','Barney Stinson'),
    (5,'Aegon','Aegon Targaryen','John Snow');

 * sqlite:///MyDataBase.db
Done.

[]

## Exercises: 

1. Use the `class User` to insert 5 rows of data into the table `user`
2. Insert 5 additional rows but this time using queries

In [15]:
## your code

In [16]:
%%sql

--# Your code

 * sqlite:///MyDataBase.db
0 rows affected.

[]

## Preview values in table

### *Using queries:*

In [17]:
%%sql

SELECT * FROM user;

 * sqlite:///MyDataBase.db
Done.

[(1, 'Arnold', 'Arnold Schwarzenegger', 'Terminator'),
 (2, 'Jennifer', 'Jennifer Aniston', 'Rachel'),
 (3, 'Tyrannosaurus', 'Tyrannosaurus Rex', 'T-Rex'),
 (4, 'Neil', 'Neil Patrick Harris', 'Barney Stinson'),
 (5, 'Aegon', 'Aegon Targaryen', 'John Snow')]

### *ORM approach*:

In [18]:
from sqlalchemy import inspect
inspector = inspect(engine)

# Get table information
print(inspector.get_table_names())

['user']

In [19]:
# Get values in table:

print("----> user by (name):")
query = session.query(User)
for _row in query.all():
    print(_row.id, _row.name, _row.fullname, _row.nickname)

----> user by (name):
1 Arnold Arnold Schwarzenegger Terminator
2 Jennifer Jennifer Aniston Rachel
3 Tyrannosaurus Tyrannosaurus Rex T-Rex
4 Neil Neil Patrick Harris Barney Stinson
5 Aegon Aegon Targaryen John Snow

## Exercises: Modify the code of the previous cell to stored the printed values on:

1. A pandas DataFrame
2. A dictionary

In [20]:
# your awesome code

## Insert new table using queries

In [21]:
%%sql

CREATE TABLE media (
    id          INTEGER PRIMARY KEY NOT NULL,
    production  TEXT NOT NULL,
    year        NUMBER NOT NULL
    );

 * sqlite:///MyDataBase.db
Done.

[]

In [22]:
%%sql
--# Insert values on table `media`
INSERT INTO media(id, production, year)
    VALUES (1,'Terminator',1984), 
    (2,'Friends', 1994), 
    (3,'Toy Story', 1995), 
    (4,'How I met your mother', 2005),
    (5,'Game of thrones',2011);

 * sqlite:///MyDataBase.db
Done.

[]

In [23]:
%%sql

SELECT * FROM media;

 * sqlite:///MyDataBase.db
Done.

[(1, 'Terminator', 1984),
 (2, 'Friends', 1994),
 (3, 'Toy Story', 1995),
 (4, 'How I met your mother', 2005),
 (5, 'Game of thrones', 2011)]

## Exercise: Complete the values on the table `media` that corresponds to your previous inputs on the table `user`.

In [1]:
# awesome code

## Well done! Now you have more tools on your skills-set,

You are also ready for this joke:

**An SQL query walks into a bar and sees two tables. He walks up to them and says:**

![A bad SQL joke](https://cdn.dribbble.com/users/1463678/screenshots/3212815/tables-dribbble.png)

Resources:
- [SQL query practice](https://www.sql-practice.com/)
- [Udacity Database Setup using SQLAlchemy](https://github.com/udacity/Full-Stack-Foundations/blob/master/Lesson_1/database_setup.py)
- [Cheat sheet SQL Alchemy](https://www.pythonsheets.com/notes/python-sqlalchemy.html)
- [SQL Workshop](https://tdmdal.github.io/mma-sql/)
- [Read the docs](https://docs.sqlalchemy.org/en/14/orm/mapping_styles.html)
- [ORM For Python: SQLAlchemy 101](https://medium.com/@haataa/orm-for-python-sqlalchemy-101-with-code-example-60868e65b0c)
- [Tutorial FastAPI & work with databases](https://fastapi.tiangolo.com/tutorial/sql-databases/)